app/controllers/products_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @product = Product.new

    @categories = Category.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "categories".* FROM "categories"
---
  def edit
    @product = Product.find(params[:id])

    @categories = Category.all

INSERT INTO "products" ("category_id", "created_at", "description", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(params[:product])
    @product.user = current_user

    respond_to do |format|
      if @product.save